blog/2014-04-09-my-first-octopress-blog.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 星期五, 十二月  2, 2022 at  4:06 下午 -->
<meta charset="utf-8" />
<title>Setting up this blog</title>
<meta name="author" content="Kinhung Lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
<div class="published">
Published 星期一, 三月 24, 2014 at  6:19 下午
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Setting up this blog</h1>
</header>
<div id="outline-container-org099076f" class="outline-2">
<h2 id="org099076f">&#x2013;Setting up this blog</h2>
<div class="outline-text-2" id="text-org099076f">
<p>
:CUSTOM_ID: setting-up-this-blog
</p>
<p>
Apparently I&rsquo;m using emacs org mode to power this
blog.Many thanks for the nice framework that save me a lot of time to
get up to speed.I probably wouldn&rsquo;t have decided to move my blog here in
the first place if there weren&rsquo;t ready-to-use solutions for lazy people
like me.
</p>

<p>
Anyway, here&rsquo;s the link to my old blog: <a href="http://javalinjx.iteye.com/">http://javalinjx.iteye.com/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
